swak4Foam/Examples/RegionSolvers/cavityWithHeater/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00325;

boundaryField
{
    movingWall
    {
        type            kqRWallFunction;
        value           uniform 0.00325;
    }
    "fixedWall.*"
    {
        type            kqRWallFunction;
        value           uniform 0.00325;
    }
    "cavity_to_(.+)Heater" {
        $fixedWallBottom;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
